---
kind: type
id: T:Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves
source: html/3af783ff-1aca-2c81-659d-edbaa72065d7.htm
---
# Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves

This class captures results of computation of closest points between two generic curves.

## Syntax (C#)
```csharp
public class ClosestPointsPairBetweenTwoCurves : IDisposable
```